sewTogether/app/views/comments/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."project_id" = 1 ORDER BY created_at DESC
---
<%unless @project.comments.nil?%>
  <%@project.comments.each do |comment|%>