sewTogether/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? ORDER BY created_at ASC LIMIT 1  [["id", "5"]]
---
  def edit
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("created_at", "part", "project_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 06 May 2013 17:27:17 UTC +00:00], ["part", "step1"], ["project_id", 1], ["text", "comment"], ["updated_at", Mon, 06 May 2013 17:27:17 UTC +00:00], ["user_id", nil]]
---
  def create
	@comment = Comment.new(params[:comment])
	@comment.user = current_user
	#unsafe code because it trusts the user
	#not to modify @comment.project and @comment.part
	@project = @comment.project
	@part = @comment.part
    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy