sewTogether/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."name" = 'Strawberry Cream Roll' LIMIT 1
SELECT 1 AS one FROM "projects" WHERE (name = 'Strawberry Cream Roll') LIMIT 1
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
	current_user = User.new
	name = params[:name]
	if (params[:name].present? and Project.where("name = ?", name).exists?)
		@project = Project.find_by_name(name)
	else
		@project = Project.find(params[:id])