sewTogether/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)
---
	def create
		@user = User.new(params[:user])
		if @user.save